workshops/gettingComfortableWithPython/README.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Getting comfortable with Python</title>
<meta name="author" content="Compro Prasad"/>
<link rel="stylesheet" href="../../reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="../../reveal.js/css/theme/black.css" id="theme"/>

<link rel="stylesheet" href="../custom.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Getting comfortable with Python</h1>
</section>

<section>
<section id="slide-orgdfa7701">
<h2 id="orgdfa7701">What to expect</h2>
<p>
Lots of <b>small things</b> that you can do to have a <b>better experience</b> with Python.
</p>
</section>
</section>
<section>
<section id="slide-org4529b9c">
<h2 id="org4529b9c">What not to expect</h2>
<ul>
<li>Writing <code>Hello World</code> program</li>
<li>Defining <code>variables</code> and <code>functions</code></li>
<li>Working with various datatypes like <code>list</code>, <code>dict</code>, <code>str</code>, <code>int</code>, etc.</li>
<li><code>Data structures</code> and <code>algorithms</code></li>

</ul>
</section>
</section>
<section>
<section id="slide-org9c858e5">
<h2 id="org9c858e5">Formatted(<code>f</code>) strings</h2>
<div class="outline-text-2" id="text-org9c858e5">
</div>
</section>
<section id="slide-org69e5385">
<h3 id="org69e5385">Also known as <b>string interpolation</b></h3>
</section>
<section id="slide-org0dace07">
<h3 id="org0dace07">Works in Python 3.6 and above</h3>
</section>
<section id="slide-orge12ebc5">
<h3 id="orge12ebc5">Normal string</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_all_results</span>(table_name):
     <span style="color: #4f97d7; font-weight: bold;">return</span> run_query(
          <span style="color: #2d9574;">"SELECT * from "</span> + table_name + <span style="color: #2d9574;">";"</span>
     )
</pre>
</div>
</section>
<section id="slide-org043991f">
<h3 id="org043991f">Using <code>f</code> string</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_all_results</span>(table_name):
     <span style="color: #4f97d7; font-weight: bold;">return</span> run_query(
          f<span style="color: #2d9574;">"SELECT * from </span>{table_name}<span style="color: #2d9574;">;"</span>
     )
</pre>
</div>
</section>
<section id="slide-orgc39a407">
<h3 id="orgc39a407">Further Reference</h3>
<ul>
<li><a href="https://docs.python.org/3/whatsnew/3.6.html#whatsnew36-pep498">https://docs.python.org/3/whatsnew/3.6.html#whatsnew36-pep498</a></li>
<li><a href="http://cis.bentley.edu/sandbox/wp-content/uploads/Documentation-on-f-strings.pdf">http://cis.bentley.edu/sandbox/wp-content/uploads/Documentation-on-f-strings.pdf</a></li>
<li><a href="https://realpython.com/python-f-strings/">https://realpython.com/python-f-strings/</a></li>
<li><a href="https://www.geeksforgeeks.org/formatted-string-literals-f-strings-python/">https://www.geeksforgeeks.org/formatted-string-literals-f-strings-python/</a></li>

</ul>

</section>
</section>
<section>
<section id="slide-orgb4c0776">
<h2 id="orgb4c0776">Raw(<code>r</code>) strings</h2>
<div class="outline-text-2" id="text-orgb4c0776">
</div>
</section>
<section id="slide-org6de4e11">
<h3 id="org6de4e11">Normal string</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">open</span>(<span style="color: #2d9574;">"C:\\Some\\file\\name.txt"</span>) <span style="color: #4f97d7; font-weight: bold;">as</span> f:
    <span style="color: #4f97d7; font-weight: bold;">print</span>(f.read(100))
</pre>
</div>
</section>
<section id="slide-org312f23e">
<h3 id="org312f23e">Using <code>r</code> string</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">open</span>(r<span style="color: #2d9574;">"C:\Some\file\name.txt"</span>) <span style="color: #4f97d7; font-weight: bold;">as</span> f:
    <span style="color: #4f97d7; font-weight: bold;">print</span>(f.read(100))
</pre>
</div>
</section>
<section id="slide-org483c45e">
<h3 id="org483c45e">How are they different</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span>(r<span style="color: #2d9574;">'Hello\tWorld'</span> != <span style="color: #2d9574;">'Hello\tWorld'</span>)
</pre>
</div>

<pre class="example">
True
</pre>
</section>
<section id="slide-org8dc872c">
<h3 id="org8dc872c">How are they same</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span>(r<span style="color: #2d9574;">'Hello\tWorld'</span> == <span style="color: #2d9574;">'Hello\\tWorld'</span>)
</pre>
</div>

<pre class="example">
True
</pre>
</section>
<section id="slide-orgf8ac5d4">
<h3 id="orgf8ac5d4">Further Reference</h3>
<ul>
<li><a href="https://medium.com/dev-genius/beauty-of-raw-strings-in-python-fa627d674cbf">https://medium.com/dev-genius/beauty-of-raw-strings-in-python-fa627d674cbf</a></li>
<li><a href="https://www.askpython.com/python/string/python-raw-strings">https://www.askpython.com/python/string/python-raw-strings</a></li>

</ul>

</section>
</section>
<section>
<section id="slide-org50432ab">
<h2 id="org50432ab">Exception(Error) handling</h2>
<div class="outline-text-2" id="text-org50432ab">
</div>
</section>
<section id="slide-org5394ab8">
<h3 id="org5394ab8">Sample Code</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">student</span> = {
    <span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Ram"</span>
}
<span style="color: #4f97d7; font-weight: bold;">print</span>(student[<span style="color: #2d9574;">"mother"</span>])
</pre>
</div>

<p>
Find the error.
</p>

</section>
<section id="slide-org280042f">
<h3 id="org280042f">Error</h3>
<pre class="example" id="org490baed">
Traceback (most recent call last):
File "&lt;stdin&gt;", line 4, in &lt;module&gt;
KeyError: 'mother'
</pre>
<p>
Here type of the error is <code>KeyError</code>. All errors have this information at the
end of error output.
</p>

</section>
<section id="slide-org0777959">
<h3 id="org0777959">Catching errors</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">student</span> = {
    <span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Ram"</span>
}
<span style="color: #4f97d7; font-weight: bold;">try</span>:
    <span style="color: #4f97d7; font-weight: bold;">print</span>(student[<span style="color: #2d9574;">"mother"</span>])
<span style="color: #4f97d7; font-weight: bold;">except</span> <span style="color: #ce537a; font-weight: bold;">KeyError</span> <span style="color: #4f97d7; font-weight: bold;">as</span> error:
    <span style="color: #4f97d7; font-weight: bold;">print</span>(f<span style="color: #2d9574;">"Key not found </span>{error}<span style="color: #2d9574;">"</span>)
</pre>
</div>

<pre class="example">
Key not found 'mother'
</pre>

</section>
<section id="slide-org959733a">
<h3 id="org959733a">Catching multiple errors?</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">student</span> = {
    <span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Ram"</span>,
    <span style="color: #2d9574;">"roll"</span>: 1
}
<span style="color: #7590db;">keys</span> = [<span style="color: #2d9574;">"name"</span>, <span style="color: #2d9574;">"roll"</span>, <span style="color: #2d9574;">"dob"</span>]
<span style="color: #4f97d7; font-weight: bold;">for</span> key <span style="color: #4f97d7; font-weight: bold;">in</span> keys:
    <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"Output:"</span>, student[key] + 1)
</pre>
</div>

</section>
<section id="slide-orgbb25562">
<h3 id="orgbb25562">Catching multiple errors (Solution)</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">student</span> = {
    <span style="color: #2d9574;">"name"</span>: <span style="color: #2d9574;">"Ram"</span>,
    <span style="color: #2d9574;">"roll"</span>: 1
}
<span style="color: #7590db;">keys</span> = [<span style="color: #2d9574;">"name"</span>, <span style="color: #2d9574;">"roll"</span>, <span style="color: #2d9574;">"dob"</span>]
<span style="color: #4f97d7; font-weight: bold;">for</span> key <span style="color: #4f97d7; font-weight: bold;">in</span> keys:
    <span style="color: #4f97d7; font-weight: bold;">try</span>:
        <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"Output:"</span>, student[key] + 1)
    <span style="color: #4f97d7; font-weight: bold;">except</span> <span style="color: #ce537a; font-weight: bold;">KeyError</span> <span style="color: #4f97d7; font-weight: bold;">as</span> error:
        <span style="color: #4f97d7; font-weight: bold;">print</span>(f<span style="color: #2d9574;">"Key not found </span>{error}<span style="color: #2d9574;">"</span>)
    <span style="color: #4f97d7; font-weight: bold;">except</span> <span style="color: #ce537a; font-weight: bold;">TypeError</span>:
        <span style="color: #4f97d7; font-weight: bold;">print</span>(f<span style="color: #2d9574;">"Can't add 1 to '</span>{key}<span style="color: #2d9574;">'"</span>)
    <span style="color: #4f97d7; font-weight: bold;">except</span> <span style="color: #ce537a; font-weight: bold;">Exception</span> <span style="color: #4f97d7; font-weight: bold;">as</span> error:
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Catches all other errors</span>
        <span style="color: #4f97d7; font-weight: bold;">print</span>(f<span style="color: #2d9574;">"Key: '</span>{key}<span style="color: #2d9574;">', Error: </span>{error}<span style="color: #2d9574;">"</span>)
</pre>
</div>

</section>
<section id="slide-org86599fc">
<h3 id="org86599fc">Further reference</h3>
<ul>
<li><a href="https://docs.python.org/3/library/exceptions.html">https://docs.python.org/3/library/exceptions.html</a></li>
<li><a href="https://www.tutorialspoint.com/python/python_exceptions.htm">https://www.tutorialspoint.com/python/python_exceptions.htm</a></li>
<li><a href="https://www.programiz.com/python-programming/exception-handling">https://www.programiz.com/python-programming/exception-handling</a></li>
<li><a href="https://www.geeksforgeeks.org/python-exception-handling/">https://www.geeksforgeeks.org/python-exception-handling/</a></li>

</ul>

</section>
</section>
<section>
<section id="slide-orgdeb7734">
<h2 id="orgdeb7734">Object Oriented Programming</h2>
</section>
