workshops/gettingComfortableWithPython/README.html
<section id="slide-org3c6d93c">
<h3 id="org3c6d93c">Constructor and Destructor</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Vehicle</span>:
    <span style="color: #9f8766;">"""Vehicle docstring"""</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, name, max_speed):
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">constructor</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Public members</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.name = name
        <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">max_speed</span> = max_speed
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Private members begin with _</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">_current_speed</span> = 0
        <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"Constructed"</span>)

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__del__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Destructor</span>
        <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"Destroyed"</span>)
</pre>
</div>

</section>
<section id="slide-orgc1dfb00">
<h3 id="orgc1dfb00">Creating an object</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #7590db;">car</span> = Vehicle(<span style="color: #2d9574;">"Maruti 800"</span>, 140)
<span style="color: #4f97d7; font-weight: bold;">print</span>(car)
</pre>
</div>

<pre class="example">
Constructed
&lt;__main__.Vehicle object at 0x7fe494596d60&gt;
</pre>

</section>
<section id="slide-org6491442">
<h3 id="org6491442">Inheritance</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Car</span>(Vehicle):
    <span style="color: #9f8766;">"""Car doc"""</span>
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, name, max_speed):

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Call base class constructor</span>
        <span style="color: #4f97d7;">super</span>().__init__(name, max_speed)

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Create new members</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #7590db;">wheels</span> = 4
</pre>
</div>

</section>
<section id="slide-org043d3d1">
<h3 id="org043d3d1">Polymorphism</h3>
<div class="outline-text-3" id="text-org043d3d1">
</div>
</section>
<section id="slide-org2bd20b4">
<h4 id="org2bd20b4">Square class</h4>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Square</span>:
    <span style="color: #9f8766;">"""Square doc"""</span>
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, side):
        <span style="color: #4f97d7; font-weight: bold;">self</span>.side = side
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">area</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
        <span style="color: #9f8766;">"""Find the area"""</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.side * <span style="color: #4f97d7; font-weight: bold;">self</span>.side
</pre>
</div>

</section>
<section id="slide-org1e3c784">
<h4 id="org1e3c784">Circle class</h4>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Circle</span>:
    <span style="color: #9f8766;">"""Circle doc"""</span>
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>, radius):
        <span style="color: #4f97d7; font-weight: bold;">self</span>.radius = radius
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">area</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
        <span style="color: #9f8766;">"""Find the area"""</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> 3.1416 * <span style="color: #4f97d7; font-weight: bold;">self</span>.radius * <span style="color: #4f97d7; font-weight: bold;">self</span>.radius
</pre>
</div>

</section>
<section id="slide-org6953b5f">
<h4 id="org6953b5f">Calculate area</h4>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span>(Square(5).area())
<span style="color: #4f97d7; font-weight: bold;">print</span>(Circle(5).area())
</pre>
</div>

<pre class="example">
25
78.54
</pre>

</section>
<section id="slide-org1fe5fc6">
<h3 id="org1fe5fc6">Abstract classes</h3>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Foo</span>(metaclass=abc.ABCMeta):
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">No objects can be made of this class</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Because of abstract methods</span>
    <span style="color: #ce537a; font-weight: bold;">@abc.abstractmethod</span>
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">foo</span>(<span style="color: #4f97d7; font-weight: bold;">self</span>):
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">This needs to be implemented</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">after inheritance</span>
        <span style="color: #4f97d7; font-weight: bold;">pass</span>
</pre>
</div>
<p>
Reference: <a href="https://stackoverflow.com/questions/26458618/are-python-pure-virtual-functions-possible-and-or-worth-it">https://stackoverflow.com/questions/26458618/are-python-pure-virtual-functions-possible-and-or-worth-it</a>
</p>

</section>
<section id="slide-org2798976">
<h3 id="org2798976">Using <code>__repr__</code> and <code>__str__</code></h3>

</section>
</section>
<section>
<section id="slide-org245a910">
<h2 id="org245a910">Python Virtual Environment</h2>
<div class="outline-text-2" id="text-org245a910">
</div>
</section>
<section id="slide-org86cd88e">
<h3 id="org86cd88e">Why is it used?</h3>
<p>
Isolate different versions of python and python packages.
</p>
</section>
<section id="slide-org9b182ef">
<h3 id="org9b182ef">How to setup using builtin <code>venv</code></h3>
<div class="org-src-container">

<pre class="src src-sh">python -m venv testenv
</pre>
</div>
<p>
Creates a new directory <code>testenv</code> with the python version and builtin modules.
</p>

</section>
<section id="slide-orgd226768">
<h3 id="orgd226768">Loading the environment</h3>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #4f97d7;">source</span> testenv/bin/activate  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">*nix</span>
testenv\Scripts\activate.bat  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Windows</span>
</pre>
</div>
<p>
This modifies environment variables like <code>PATH</code> which helps in prioritizing
python from the virtual environment.
</p>
</section>
<section id="slide-orgadc2f9a">
<h3 id="orgadc2f9a">Installing packages</h3>
<div class="org-src-container">

<pre class="src src-sh">pip install requests
pip install -r requirements.txt
</pre>
</div>
<p>
This will install all packages in the virtual environment when its activated.
</p>

</section>
<section id="slide-org7cea597">
<h3 id="org7cea597">Unloading the environment</h3>
<div class="org-src-container">

<pre class="src src-sh">deactivate
</pre>
</div>
<p>
This reverts the changes done to the environment variables.
</p>

</section>
<section id="slide-org75ceade">
<h3 id="org75ceade">Further Reference</h3>
<ul>
<li><a href="https://docs.conda.io/projects/conda/en/latest/user-guide/tasks/manage-environments.html">Conda</a></li>
<li><a href="https://docs.python.org/3/library/venv.html">Venv</a></li>
<li><a href="https://realpython.com/pipenv-guide/">Pipenv</a></li>

</ul>

</section>
</section>
<section>
<section id="slide-org18f6534">
<h2 id="org18f6534">Running a command</h2>

</section>
</section>
<section>
<section id="slide-orgbe962d1">
<h2 id="orgbe962d1"><span class="todo TODO">TODO</span> Using pylint to write good code</h2>
</section>
</section>
<section>
<section id="slide-org34a4816">
<h2 id="org34a4816"><span class="todo TODO">TODO</span> Unit testing using doctest</h2>
</section>
</section>
<section>
<section id="slide-orgcdf9c7a">
<h2 id="orgcdf9c7a"><span class="todo TODO">TODO</span> Importing local modules</h2>
<div class="outline-text-2" id="text-orgcdf9c7a">
</div>
</section>
<section id="slide-orga41ea4a">
<h3 id="orga41ea4a">Make sure you don't use module names same as builtins</h3>
</section>
</section>
<section>
<section id="slide-orge50c511">
<h2 id="orge50c511"><span class="todo TODO">TODO</span> Pretty printing large list/dict</h2>
</section>
</section>
<section>
<section id="slide-org2fdd2fe">
<h2 id="org2fdd2fe"><span class="todo TODO">TODO</span> Using datetime and timedelta</h2>
</section>
</section>
<section>
<section id="slide-orgdfcf466">
<h2 id="orgdfcf466"><span class="todo TODO">TODO</span> Not using regular expressions</h2>
</section>
</section>
<section>
<section id="slide-orga579acc">
<h2 id="orga579acc"><span class="todo TODO">TODO</span> Good IDEs for Python</h2>
<div class="outline-text-2" id="text-orga579acc">
</div>
</section>
